Revit 2027 API
AdvancedMetal Class
 A static class that provides access to the property names that appear in the AdvancedMetal visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AdvancedMetal
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class AdvancedMetal
Public NotInheritable Class AdvancedMetal
public ref class AdvancedMetal abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AdvancedMetal = class end
The AdvancedMetal type exposes the following members.
Properties
Name | Description
MetalF0 |  The property labeled "Reflectance" from the "AdvancedMetal" schema.
SurfaceAlbedo |  The property labeled "Color" from the "AdvancedMetal" schema.
SurfaceAnisotropy |  The property labeled "Anisotropy" from the "AdvancedMetal" schema.
SurfaceCutout |  The property labeled "Image" from the "AdvancedMetal" schema.
SurfaceNdfType |  The property labeled "NDF" from the "AdvancedMetal" schema.
SurfaceNormal |  The property labeled "Image" from the "AdvancedMetal" schema.
SurfaceRotation |  The property labeled "Rotation" from the "AdvancedMetal" schema.
SurfaceRoughness |  The property labeled "Roughness" from the "AdvancedMetal" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace